/*
 * Copyright © 2025 Bithatch (tanktarta@gmail.com)
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of this
 * software and associated documentation files (the “Software”), to deal in the Software
 * without restriction, including without limitation the rights to use, copy, modify,
 * merge, publish, distribute, sublicense, and/or sell copies of the Software, and to
 * permit persons to whom the Software is furnished to do so, subject to the following
 * conditions:
 *
 * The above copyright notice and this permission notice shall be included in all copies
 * or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
 * INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
 * PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
 * HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION
 * OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
 * SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */
// Generated by jextract

package uk.co.bithatch.linid.impl.linux;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct option {
 *     const char *name;
 *     int has_arg;
 *     int *flag;
 *     int val;
 * }
 * }
 */
public class option {

    option() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        nss_proto_h.C_POINTER.withName("name"),
        nss_proto_h.C_INT.withName("has_arg"),
        MemoryLayout.paddingLayout(4),
        nss_proto_h.C_POINTER.withName("flag"),
        nss_proto_h.C_INT.withName("val"),
        MemoryLayout.paddingLayout(4)
    ).withName("option");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final OfInt has_arg$LAYOUT = (OfInt)$LAYOUT.select(groupElement("has_arg"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int has_arg
     * }
     */
    public static final OfInt has_arg$layout() {
        return has_arg$LAYOUT;
    }

    private static final long has_arg$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int has_arg
     * }
     */
    public static final long has_arg$offset() {
        return has_arg$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int has_arg
     * }
     */
    public static int has_arg(MemorySegment struct) {
        return struct.get(has_arg$LAYOUT, has_arg$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int has_arg
     * }
     */
    public static void has_arg(MemorySegment struct, int fieldValue) {
        struct.set(has_arg$LAYOUT, has_arg$OFFSET, fieldValue);
    }

    private static final AddressLayout flag$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("flag"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int *flag
     * }
     */
    public static final AddressLayout flag$layout() {
        return flag$LAYOUT;
    }

    private static final long flag$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int *flag
     * }
     */
    public static final long flag$offset() {
        return flag$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int *flag
     * }
     */
    public static MemorySegment flag(MemorySegment struct) {
        return struct.get(flag$LAYOUT, flag$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int *flag
     * }
     */
    public static void flag(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(flag$LAYOUT, flag$OFFSET, fieldValue);
    }

    private static final OfInt val$LAYOUT = (OfInt)$LAYOUT.select(groupElement("val"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int val
     * }
     */
    public static final OfInt val$layout() {
        return val$LAYOUT;
    }

    private static final long val$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int val
     * }
     */
    public static final long val$offset() {
        return val$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int val
     * }
     */
    public static int val(MemorySegment struct) {
        return struct.get(val$LAYOUT, val$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int val
     * }
     */
    public static void val(MemorySegment struct, int fieldValue) {
        struct.set(val$LAYOUT, val$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

